#2
# Input (ინპუტი) ნიშნავს იმ მონაცემს, რომელსაც პროგრამა იღებს მომხმარებლისგან !
# მაგალითად როცა მომხმარებელი კლავიატურაზე წერს !
name = input("შეიყვანეთ თქვენი სახელი: ")

# output (აუთპუთი) ნიშნავს შედეგს, რომელსაც პროგრამა აბრუნებს !
# მაგალითად პროგრამა ეკრანზე აჩვენებს რაიმე სახის წარწერას !
print("გამარჯობა",name)

#3
data = input("შეიყვანეთ რაიმე მნიშვნელობ: ")
#print = ("ცვლადში შენახული მნიშვნელობა", type(data))   #კომენტარის სახით რადგან სხვა კოდმა ერორი არ ამოაგდოს !

#4
name = "ani"       # str ტიპი  ინახავს --> სახელს ! 
city = "tbilisi"    # str ტიპი  ინახავს --> ქალაქს !
food = "khinkali"     # str ტიპი  ინახავს -->საჭმელს !
favcolor = "blue"      # str ტიპი  ინახავს --> ფერს !
country = "georgia"      # str ტიპი  ინახავს --> ქვეყენას !

age = 22   # int ტიპი  ინახავს --> ინახავს ასაკს !
year = 2026   # int ტიპი  ინახავს --> ინახავს წელს !
born = 2008   # int ტიპი  ინახავს --> ინახავს დაბადების წელს !
days = 7   # int ტიპი ინახავს --> ინახავს დღეს !
students = 20   # int ტიპი  ინახავს --> ინახავს მოსწავლეებს !

height = 1.75   # float ტიპი  ინახავს --> სიმაღლეს !
weight = 65.5   # float ტიპი  ინახავს --> წონას !
price = 9.99    # float ტიპი  ინახავს --> ფასს !
distance = 12.4     # float ტიპი ინახავს --> მანძილს !

#5
# name = "Nika"   # str
# age = 20          # int
# height = 1.75     # float

# print(type(name))
# print(type(age))
# print(type(height))


#6
first_word = input("შეიყვანეთ პრიველი სიტყვა: ")
second_word = input("შეიყვანეთ მეორე სიტყვა:")

result = (first_word + " " + second_word)
print(result)

#7
num1 = float(input("შეიყვანე პირველი რიცხვი: "))
num2 = float(input("შეიყვანე მეორე რიცხვი: "))
num3 = float(input("შეიყვანე მესამე რიცხვი: "))
num4 = float(input("შეიყვანე მეოთხე რიცხვი: "))
num5 = float(input("შეიყვანე მეხუთე რიცხვი: "))
 
Average = (num1 + num2 + num3 + num4 + num5)/5
print("საშუალო არითმეტიკული არის:", Average)

#8
ame = input("შეიყვანე სახელი: ")
surname = input("შეიყვანე გვარი: ")
age = input("შეიყვანე ასაკი: ")
height = input("შეიყვანე სიმაღლე: ")
weight = input("შეიყვანე წონა: ")

print("ჩემი სახელია", name, surname + ", მე ვარ", age, "წლის, ჩემი სიმაღლეა", height, "და ჩემი წონაა", weight + ".")